# StopCutShadowJoin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures..::..StopCutShadowJoin Property
BuiltInFailures..::..ColumnInsideWallFailures Class See Also
---
Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StopCutShadowJoin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StopCutShadowJoin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StopCutShadowJoin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace